projects.html
---
layout: projects
title: Projects
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Notable Open Source Projects</h2>
<div class="outline-text-2" id="text-1">
<p>
The following is a list of open source projects I've authored or co-authored.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Om-Bootstrap</h3>
<div class="outline-text-3" id="text-1-1">
<p>
[Om-Bootstrap](<a href="https://github.com/racehub/om-bootstrap">https://github.com/racehub/om-bootstrap</a>) is a ClojureScript library of [Bootstrap 3](<a href="http://getbootstrap.com">http://getbootstrap.com</a>) components built on top of [Om](<a href="https://github.com/swannodette/om">https://github.com/swannodette/om</a>). This is my first big client side library! Definitely a change of scenery.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Summingbird</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://github.com/twitter/summingbird">Summingbird</a> is a library that lets you write MapReduce programs that look like native Scala or Java collection transformations. So, while a word-counting aggregation in pure Scala might look like this:
</p>

<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">wordCount</span>(source<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Iterable</span>[<span style="color: #BFEBBF;">String</span>], store<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">MutableMap</span>[<span style="color: #BFEBBF;">String</span>, <span style="color: #BFEBBF;">Long</span>]) <span style="color: #F0DFAF; font-weight: bold;">=</span>
  source.flatMap { sentence <span style="color: #F0DFAF; font-weight: bold;">=&gt;</span>
    toWords(sentence).map(<span style="color: #F0DFAF; font-weight: bold;">_</span> -&gt; <span style="color: #BFEBBF;">1L</span>)
  }.foreach { <span style="color: #F0DFAF; font-weight: bold;">case</span> (<span style="color: #DFAF8F;">k</span>, <span style="color: #DFAF8F;">v</span>) <span style="color: #F0DFAF; font-weight: bold;">=&gt;</span> store.update(k, store.get(k) + v) }
</pre>
</div>

<p>
Counting words in Summingbird looks like this:
</p>

<div class="org-src-container">

<pre class="src src-scala"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">wordCount</span>[<span style="color: #BFEBBF;">P</span> <span style="color: #F0DFAF; font-weight: bold;">&lt;:</span> <span style="color: #BFEBBF;">Platform</span>[<span style="color: #BFEBBF;">P</span>]]
  (source<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">Producer</span>[<span style="color: #BFEBBF;">P</span>, <span style="color: #BFEBBF;">String</span>], store<span style="color: #F0DFAF; font-weight: bold;">:</span> <span style="color: #7CB8BB;">P</span><span style="color: #F0DFAF; font-weight: bold;">#</span><span style="color: #BFEBBF;">Store</span>[<span style="color: #BFEBBF;">String</span>, <span style="color: #BFEBBF;">Long</span>]) <span style="color: #F0DFAF; font-weight: bold;">=</span>
    source.flatMap { sentence <span style="color: #F0DFAF; font-weight: bold;">=&gt;</span>
      toWords(sentence).map(<span style="color: #F0DFAF; font-weight: bold;">_</span> -&gt; <span style="color: #BFEBBF;">1L</span>)
    }.sumByKey(store)
</pre>
</div>

<p>
The logic is exactly the same, and the code is almost the same. The main difference is that you can execute the Summingbird program in "batch mode" (using <a href="https://github.com/twitter/scalding">Scalding</a>), in "realtime mode" (using <a href="https://github.com/nathanmarz/storm">Storm</a>), or on both Scalding and Storm in a hybrid batch/realtime mode that offers your application very attractive fault-tolerance properties.
</p>

<p>
Summingbird provides you with the primitives you need to build rock solid production systems.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Storehaus</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://github.com/twitter/storehaus">Storehaus</a> is a Scala library that makes it easy to work with asynchronous key-value stores.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Bijection</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A <a href="https://github.com/twitter/bijection">Bijection</a> is a function that can be inverted. Practically, in Scala, Bijections are used to tell the type system about equivalent concepts that may have been defined in different libraries (<code>scala.Int</code> vs <code>java.lang.Integer</code>, for example.) The ability to declare these equivalences is hugely valuable.
</p>

<p>
<code>Injection</code>, a related trait included in the library, is a function that can sometimes be inverted. (Your item might be able to convert to a byte array, but not all byte arrays can come back, for example.) <code>Injection</code> and <code>Bijection</code> turn out to be wonderful at describing serializations. We use the concept heavily in Summingbird and other distributed systems at Twitter.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Algebird</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="https://github.com/twitter/algebird">Algebird</a> is an abstract algebra library for Scala. Algebird is designed with streaming aggregations in mind, and implements a number of types and combinators that are useful in a streaming mapreduce environment. The <code>Monoid</code>, for example, is a core concept of Summingbird, Twitter's streaming MapReduce library.
</p>

<p>
Here are some of the more exotic data structures in Algebird:
</p>

<ul class="org-ul">
<li>CountMinSketch
</li>
<li>SketchMap
</li>
<li>HyperLogLog
</li>
<li>Stochastic Gradient Descent
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Chill</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="https://github.com/twitter/chill">Chill</a> provides a number of enhancements to the <a href="https://code.google.com/p/kryo/">Kryo</a> JVM serialization library; notably, serializers for all scala primitives and collection types, and plugins that make it easy to use Kryo in Hadoop and Storm jobs. Scalding, Cascalog, Spark and many other projects use chill to manage serialization across their various distributed system implementations.
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Tormenta</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="https://github.com/twitter/tormenta">Tormenta</a> provides a type-safe Scala DSL over Storm, along with scala-friendly implementations of Kafka, Kestrel and Twitter Streaming API spouts for Storm.
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">FORMA</h3>
<div class="outline-text-3" id="text-1-8">
<p>
The <a href="https://github.com/reddmetrics/forma-clj">Forest Monitoring for Action</a> (FORMA) project provides free and open forest clearing alert data derived from MODIS satellite imagery every 16 days beginning in December 2005. I was the lead developer of FORMA's Clojure codebase from January 2011 to mid-2012.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Large Contributions</h2>
<div class="outline-text-2" id="text-2">
<p>
Here are other people's projects I've contributed to in large ways.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Cascalog</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://github.com/nathanmarz/cascalog">Cascalog</a> is a Datalog implementation in Clojure that compiles queries down to Hadoop jobs. I've maintained Cascalog since late 2011 and authored many core features and modules, including <a href="http://sritchie.github.io/2012/01/22/cascalog-testing-20.html">midje-cascalog</a> and <a href="http://sritchie.github.io/2011/11/15/introducing-cascalogcontrib.html">cascalog-contrib</a>. I'm currently working on Cascalog 2, which will allow Cascalog's query language to compile down to targets other than Hadoop (like Spark or Storm).
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Scalding</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://github.com/twitter/scalding">Scalding</a> is a Hadoop DSL written in Scala. I've contributed a number of designs and constructs to the codebase; many of these can be found in the <a href="https://github.com/twitter/scalding-commons">scalding-commons</a> project. Some examples are
</p>

<ul class="org-ul">
<li><a href="https://github.com/nathanmarz/dfs-datastores">dfs-datastores</a> integration via <code>PailSource</code>
</li>
<li><a href="https://github.com/twitter/scalding-commons/blob/develop/src/main/scala/com/twitter/scalding/commons/source/VersionedKeyValSource.scala">VersionedKeyValSource</a>, which makes it easy to write long-running, incrementally-updated streaming aggregations using Scalding
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">ElephantDB</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://github.com/nathanmarz/elephantdb">ElephantDB</a> is a distributed read-only key-value store designed to be populated by Hadoop. I maintained ElephantDB during the first half of 2012 and performed a major rewrite that went into production at Twitter for a time.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Pallet</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://github.com/pallet/pallet">Pallet</a> is a cloud provisioning system written in Clojure. I contributed a Hadoop cluster deploy tool called <a href="https://github.com/pallet/pallet-hadoop">pallet-hadoop</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">iOS Games</h2>
<div class="outline-text-2" id="text-3">
<p>
I developed the following games for iOS:
</p>

<ul class="org-ul">
<li><a href="http://goo.gl/etqwS">Rush Hour</a> and <a href="http://goo.gl/TLyyG">Rush Hour Free</a> (4 stars)
</li>
<li><a href="http://goo.gl/Mn8Oy">Solitaire Chess</a> and <a href="http://goo.gl/c11Vn">Solitaire Chess Free</a> (5 stars)
</li>
<li><a href="http://goo.gl/tIvBY">Chocolate Fix</a> and <a href="http://goo.gl/jYeut">Chocolate Fix Free</a> (5 stars)
</li>
</ul>
</div>
</div>
